<template>
  <div>
    <Frame/>
    <div class='tasks'>
      <h1>Задания</h1>
      <ul>
        <li class="s">Добавить карту, параметризовать (MapComponent)</li>
        <li>Нужна линейка на карте, показывающая длину линии согласно масштабу карты</li>
        <li>Нужно показывать движение транспорта на карте, оставляя транспорт всегда посередине</li>
        <li>На карте сделать разноцветную траекторию, привязанную к скорости движения транспорта</li>
        <li>Требуется сделать контрол показывающее дерево с раскрывающимися и выделяемыми ветками</li>
        <li>Требуется редактор для создания полиномов ка карте по точкам нажатия курсором мышки</li>
        <li>Механизм группирования, когда обьекты слишко близко</li>
        <li>Слои и контрол включающий и выключаюий эти слои с полиномами</li>
      </ul>
    </div>
  </div>

</template>

<script>
  import Frame from "../components/Frame";

  export default {
    name: "Tasks",
    components: {Frame}
  }
</script>

<style>
  .tasks {
    padding: 30px;
  }

  .s {
    text-decoration: line-through;
  }
</style>
